# End Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
TextRange..::..End Property
TextRange Class See Also
---
The index of the first character after the end of the range
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public int End { get; }
```

Visual Basic
---
```text
Public ReadOnly Property End As Integer
	Get
```

Visual C++
---
```text
public:
property int End {
	int get ();
}
```

# See Also
TextRange Class
Autodesk.Revit.DB Namespace